#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/miwataru/dev/runs/run-oFq8vibrkFan7XGw

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.smtp will be created
  + resource "aws_iam_access_key" "smtp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = (known after apply)
    }

  # aws_iam_user.smtp will be created
  + resource "aws_iam_user" "smtp" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = (known after apply)
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.smtp will be created
  + resource "aws_iam_user_policy" "smtp" {
      + id     = (known after apply)
      + name   = "AmazonSesSendingAccess"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = (known after apply)
    }

  # aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "miwataru.com"
      + records         = [
          + "76.76.21.21",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # aws_route53_record.root_amazonses_dkim_record[0] will be created
  + resource "aws_route53_record" "root_amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # aws_route53_record.root_amazonses_dkim_record[1] will be created
  + resource "aws_route53_record" "root_amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # aws_route53_record.root_amazonses_dkim_record[2] will be created
  + resource "aws_route53_record" "root_amazonses_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.miwataru.com"
      + records         = [
          + "cname.vercel-dns.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "miwataru-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_ses_domain_dkim.root will be created
  + resource "aws_ses_domain_dkim" "root" {
      + dkim_tokens = (known after apply)
      + domain      = "miwataru.com"
      + id          = (known after apply)
    }

  # aws_ses_domain_identity.root will be created
  + resource "aws_ses_domain_identity" "root" {
      + arn                = (known after apply)
      + domain             = "miwataru.com"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ssm_parameter.certificate_name will be created
  + resource "aws_ssm_parameter" "certificate_name" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The certificate name for all the subdomains"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/CERTIFICATE_ARN"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.db_address will be created
  + resource "aws_ssm_parameter" "db_address" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The hostname of the RDS instance"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/DB_HOST"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.db_name will be created
  + resource "aws_ssm_parameter" "db_name" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The database name"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/DB_DATABASE"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.db_password will be created
  + resource "aws_ssm_parameter" "db_password" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The master password to connect to the database"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/DB_PASSWORD"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.db_username will be created
  + resource "aws_ssm_parameter" "db_username" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The master username for the database"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/DB_USERNAME"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.domain_name will be created
  + resource "aws_ssm_parameter" "domain_name" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The domain name for the root domain"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/DOMAIN_NAME"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.hosted_zone_id will be created
  + resource "aws_ssm_parameter" "hosted_zone_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The hosted zone ID for the root domain"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/HOSTED_ZONE_ID"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.private_subnets will be created
  + resource "aws_ssm_parameter" "private_subnets" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "List of IDs of private subnets"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/PRIVATE_SUBNET_IDS"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "StringList"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.s3_bucket will be created
  + resource "aws_ssm_parameter" "s3_bucket" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "The name of the bucket"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/S3_BUCKET"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.security_group_id will be created
  + resource "aws_ssm_parameter" "security_group_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "ID of security group"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/SECURITY_GROUP_ID"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.smtp_password will be created
  + resource "aws_ssm_parameter" "smtp_password" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Secret access key converted into an SES SMTP password"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/MAIL_PASSWORD"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.smtp_username will be created
  + resource "aws_ssm_parameter" "smtp_username" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Access key ID used as the STMP username"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/Miwataru/dev/MAIL_USERNAME"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.ses will be created
  + resource "aws_vpc_endpoint" "ses" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.email-smtp"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "*.miwataru.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.miwataru.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z04139543XONVZYFSV5O"
    }

  # module.db.random_password.master_password[0] will be created
  + resource "random_password" "master_password" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vote_service_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "main-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-sg"
        }
      + tags_all               = {
          + "Name" = "main-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vote_service_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Default rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vote_service_sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "SES SMTP interface"
      + from_port                = 587
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 587
      + type                     = "ingress"
    }

  # module.vote_service_sg.aws_security_group_rule.ingress_with_self[1] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Main database"
      + from_port                = 3306
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1b"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1c"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[3] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1d"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1d"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[4] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1e"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1e"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[5] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-vpc-private-us-east-1f"
        }
      + tags_all         = {
          + "Name" = "main-vpc-private-us-east-1f"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[4] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[5] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1b"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1c"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[3] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1d"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1d"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[4] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1e"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1e"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1e"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[5] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1f"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.6.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-vpc-private-us-east-1f"
        }
      + tags_all                        = {
          + "Name" = "main-vpc-private-us-east-1f"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "main-vpc"
        }
      + tags_all                         = {
          + "Name" = "main-vpc"
        }
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = "18:00-21:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "audit",
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mariadb"
      + engine_version                        = "10.4.13"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "miwataru-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "sat:15:00-sat:18:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "miwataru_dev"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "miwataru-dev"
        }
      + tags_all                              = {
          + "Name" = "miwataru-dev"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = (known after apply)

      + timeouts {
          + create = "40m"
          + delete = "40m"
          + update = "80m"
        }
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "miwataru-dev-rds-monitoring-role"
      + path                  = "/"
      + tags                  = {
          + "Name" = "miwataru-dev-rds-monitoring-role"
        }
      + tags_all              = {
          + "Name" = "miwataru-dev-rds-monitoring-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "miwataru-dev-rds-monitoring-role"
    }

  # module.db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mariadb"
      + id                       = (known after apply)
      + major_engine_version     = "10.4"
      + name                     = (known after apply)
      + name_prefix              = "miwataru-dev-"
      + option_group_description = "miwataru-dev option group"
      + tags                     = {
          + "Name" = "miwataru-dev"
        }
      + tags_all                 = {
          + "Name" = "miwataru-dev"
        }

      + option {
          + db_security_group_memberships  = []
          + option_name                    = "MARIADB_AUDIT_PLUGIN"
          + vpc_security_group_memberships = []
        }

      + timeouts {
          + delete = "15m"
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "miwataru-dev parameter group"
      + family      = "mariadb10.4"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "miwataru-dev-"
      + tags        = {
          + "Name" = "miwataru-dev"
        }
      + tags_all    = {
          + "Name" = "miwataru-dev"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
    }

  # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "miwataru-dev subnet group"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "miwataru-dev-"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "miwataru-dev"
        }
      + tags_all    = {
          + "Name" = "miwataru-dev"
        }
    }

Plan: 58 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @zuka-e, Action: `pull_request`*